# PaperSizes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintManager..::..PaperSizes Property
PrintManager Class See Also
---
Get all print sizes of current printer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PaperSizeSet PaperSizes { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PaperSizes As PaperSizeSet
	Get
```

Visual C++
---
```text
public:
property PaperSizeSet^ PaperSizes {
	PaperSizeSet^ get ();
}
```

# Remarks
These are the valid paper sizes for the current printer.
# See Also
PrintManager Class
Autodesk.Revit.DB Namespace